app/views/students/show.html.erb

SELECT "sections".* FROM "sections" INNER JOIN "sections_students" ON "sections"."id" = "sections_students"."section_id" WHERE "sections_students"."student_id" = ?  [["student_id", 1]]
---
<ul>
  <% @student.sections.each do |section| %>