app/views/sections/_form.html.erb

    <%= form.label :course_id %>
    <%= form.collection_select :course_id, Course.all, :id, :number %>
---
SELECT "courses".* FROM "courses"

    <%= form.label :professor_id %>
    <%= form.collection_select :professor_id, Professor.all, :id, :name %>
---
SELECT "professors".* FROM "professors"

    <%= form.label :semester_id %>
    <%= form.collection_select :semester_id, Semester.all, :id, :semester %>
---
SELECT "semesters".* FROM "semesters"