app/views/courses/_form.html.erb

SELECT "departments".* FROM "departments"
---
    <%= form.label :department_id %>
    <%= form.collection_select :department_id, Department.all, :id, :name %>