app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses" WHERE (department_id LIKE '%1010%' OR number LIKE '%1010%' OR hours LIKE '%1010%')