app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE (name LIKE '%CS%')
---
  def index
    @departments = Department.search(params[:search])

INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "English"], ["created_at", "2020-10-10 22:18:36.394299"], ["updated_at", "2020-10-10 22:18:36.394299"]]
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save

DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 5]]
---
  def destroy
    @department.destroy