app/controllers/professors_controller.rb

  def index
    @professors = Professor.search(params[:search])
---
SELECT "professors".* FROM "professors"

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("name", "office", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Dandy Dave"], ["office", "WEST"], ["created_at", "2020-10-10 22:20:14.841265"], ["updated_at", "2020-10-10 22:20:14.841265"]]