app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE (semester_id LIKE '%Spring%')
---
  def index
    @sections = Section.all

SELECT "students".* FROM "students"
---
  def new
    @section = Section.new
    @students = Student.all

SELECT "students".* FROM "students" WHERE 1=0
INSERT INTO "sections" ("course_id", "professor_id", "year", "semester_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course_id", 1], ["professor_id", 1], ["year", 2020], ["semester_id", 1], ["created_at", "2020-10-10 22:27:37.984768"], ["updated_at", "2020-10-10 22:27:37.984768"]]
---
  def create
    @section = Section.new(section_params)
    @students = Student.all

    respond_to do |format|
      if @section.save

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 2]]
---
  def destroy
    @section.destroy