app/controllers/semesters_controller.rb

SELECT "semesters".* FROM "semesters" WHERE (semester LIKE '%Spring%')
---
  def index
    @semesters = Semester.search(params[:search])

INSERT INTO "semesters" ("semester", "created_at", "updated_at") VALUES (?, ?, ?)  [["semester", "1882"], ["created_at", "2020-10-10 23:11:37.994132"], ["updated_at", "2020-10-10 23:11:37.994132"]]
---
  def create
    @semester = Semester.new(semester_params)

    respond_to do |format|
      if @semester.save

DELETE FROM "semesters" WHERE "semesters"."id" = ?  [["id", 4]]
---
  def destroy
    @semester.destroy

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_semester
      @semester = Semester.find(params[:id])