app/controllers/students_controller.rb

  def index
    @students = Student.search(params[:search])
---
SELECT "students".* FROM "students"

  def new
    @student = Student.new
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def edit
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def search
    @students = Student.where("name like ?", "%#{params[:name]}")
---
SELECT "students".* FROM "students" WHERE (name like '%Tom')

  def create
    @student = Student.new(student_params)
    @sections = Section.all

    respond_to do |format|
      if @student.save
---
SELECT "sections".* FROM "sections" WHERE 1=0
INSERT INTO "students" ("name", "identifier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test Tickles"], ["identifier", 9005556789], ["created_at", "2020-10-26 00:20:36.996775"], ["updated_at", "2020-10-26 00:20:36.996775"]]